     hCopyright('(C) Copyright iSphere Project Owners')

      /if defined(VERSION_INFO)
     D ISPHERE_SERVER_VERSION...
     D                 c                   '1.2.0'
     D ISPHERE_MIN_CLIENT_VERSION...
     D                 c                   '1.4.2'

     D ISPHERE_DATE...
     D                 c                   '10.03.2014'
      /endif

